Autodesk.Revit.DB.Structure.StructuralInstanceUsage
Since:
2011
Represents the structural usage of a family instance.
Since:
2011

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.TrussWeb
Structural usage is as truss web.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.TrussChord
Structural usage is as truss chord.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Automatic
Structural usage is automatic.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.KickerBracing
Structural usage is as kicker bracing.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.HorizontalBracing
Structural usage is as horizontal bracing.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Brace
Structural usage is as brace.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Other
Structural usage is as "other".

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Purlin
Structural usage is as purlin.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Joist
Structural usage is as joist.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Girder
Structural usage is as girder.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Column
Structural usage is as column.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Wall
Structural usage is as wall.

Autodesk.Revit.DB.Structure.StructuralInstanceUsage.Undefined
indicates automatic